app/Controllers/Barang.php

    public function save()
    {
        if (!$this->validate([
            'nama_barang' => [
                'rules' => 'required'
            ],
            'deskripsi_barang' => [
                'rules' => 'required'
            ],
            'qty_barang' => [
                'rules' => 'required|numeric|greater_than[0]'
            ],
        ])) {
            $validation_nama_barang = $this->validator->getError('nama_barang');
            $validation_deskripsi_barang = $this->validator->getError('deskripsi_barang');
            $validation_qty_barang = $this->validator->getError('qty_barang');
            // dd($validation);
            // dd($this->validator->getError('nama_barang'));
            return redirect()->back()->withInput()
                ->with('validation_nama_barang', $validation_nama_barang)
                ->with('validation_deskripsi_barang', $validation_deskripsi_barang)
                ->with('validation_qty_barang', $validation_qty_barang);
            // return redirect()->to('/barang/create')->withInput()->with('validation', $validation)->with('errors', $this->validator->getErrors());
            // return redirect()->to('/barang/create')->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->barang->save([
            'jenis_barang_id' => $this->request->getVar('jenis_barang_id'),
            'nama_barang' => $this->request->getVar('nama_barang'),
            'deskripsi_barang' => $this->request->getVar('deskripsi_barang'),
            'qty_barang' => $this->request->getVar('qty_barang'),
            'cabang_id' => $this->request->getVar('cabang_id'),
        ]);
---
INSERT INTO `barang` (`jenis_barang_id`, `nama_barang`, `deskripsi_barang`, `qty_barang`, `cabang_id`) VALUES ('1', 'asd', 'asd', '1', '1')

    public function update($id)
    {
        if (!$this->validate([
            'nama_barang' => [
                'rules' => 'required'
            ],
            'deskripsi_barang' => [
                'rules' => 'required'
            ],
        ])) {
            return redirect()->to('/barang')->withInput();
        }

        $this->barang->save([
            'id_barang' => $id,
            'jenis_barang_id' => $this->request->getVar('jenis_barang_id'),
            'nama_barang' => $this->request->getVar('nama_barang'),
            'deskripsi_barang' => $this->request->getVar('deskripsi_barang'),
            'qty_barang' => $this->request->getVar('qty_barang'),
            'cabang_id' => $this->request->getVar('cabang_id'),
        ]);
---
UPDATE `barang` SET `jenis_barang_id` = '2', `nama_barang` = 'asd baru', `deskripsi_barang` = 'asd baru', `qty_barang` = '2', `cabang_id` = '2'
WHERE `barang`.`id_barang` IN ('26')