app/Models/BarangModel.php

SELECT *
FROM `barang`
JOIN `jenis_barang` ON `jenis_barang`.`id_jenis_barang`=`barang`.`jenis_barang_id`
JOIN `cabang` ON `cabang`.`id_cabang`=`barang`.`cabang_id`
ORDER BY `id_barang` DESC
SELECT *
FROM `barang`
JOIN `jenis_barang` ON `jenis_barang`.`id_jenis_barang`=`barang`.`jenis_barang_id`
JOIN `cabang` ON `cabang`.`id_cabang`=`barang`.`cabang_id`
WHERE `id_barang` = '26'
 LIMIT 1
---
    public function getBarang($id = false)
    {
        if (!$id) {
            $builder = $this->builder();
            $builder
                ->join('jenis_barang', 'jenis_barang.id_jenis_barang=barang.jenis_barang_id')
                ->join('cabang', 'cabang.id_cabang=barang.cabang_id')
                ->orderBy('id_barang', 'DESC');

            $query = $builder->get();
            return $query->getResultArray();
            // return [
            //     'barang' => $this->builder,
            // ];
        }

        return $this->where(['id_barang' => $id])
            ->join('jenis_barang', 'jenis_barang.id_jenis_barang=barang.jenis_barang_id')
            ->join('cabang', 'cabang.id_cabang=barang.cabang_id')
            ->first();

SELECT *
FROM `barang`
JOIN `jenis_barang` ON `jenis_barang`.`id_jenis_barang`=`barang`.`jenis_barang_id`
JOIN `cabang` ON `cabang`.`id_cabang`=`barang`.`cabang_id`
WHERE `nama_barang` LIKE '%zxcsadg%' ESCAPE '!'
OR  `deskripsi_barang` LIKE '%zxcsadg%' ESCAPE '!'
OR  `qty_barang` LIKE '%zxcsadg%' ESCAPE '!'
OR  `nama_jenis_barang` LIKE '%zxcsadg%' ESCAPE '!'
OR  `nama_cabang` LIKE '%zxcsadg%' ESCAPE '!'
ORDER BY `id_barang` DESC
 LIMIT 10000
SELECT COUNT(*) AS `numrows`
FROM `barang`
JOIN `jenis_barang` ON `jenis_barang`.`id_jenis_barang`=`barang`.`jenis_barang_id`
JOIN `cabang` ON `cabang`.`id_cabang`=`barang`.`cabang_id`
WHERE `nama_barang` LIKE '%zxcsadg%' ESCAPE '!'
OR  `deskripsi_barang` LIKE '%zxcsadg%' ESCAPE '!'
OR  `qty_barang` LIKE '%zxcsadg%' ESCAPE '!'
OR  `nama_jenis_barang` LIKE '%zxcsadg%' ESCAPE '!'
OR  `nama_cabang` LIKE '%zxcsadg%' ESCAPE '!'
---
    public function getBarangPaginated($num, $keyword = false)
    {
        $builder = $this->builder();
        $builder
            ->join('jenis_barang', 'jenis_barang.id_jenis_barang=barang.jenis_barang_id')
            ->join('cabang', 'cabang.id_cabang=barang.cabang_id')
            ->orderBy('id_barang', 'DESC');
        if ($keyword) {
            $builder
                ->like('nama_barang', $keyword)
                ->orLike('deskripsi_barang', $keyword)
                ->orLike('qty_barang', $keyword)
                ->orLike('nama_jenis_barang', $keyword)
                ->orLike('nama_cabang', $keyword);
        }
        return [
            'barang' => $this->paginate($num, 'barang'),
            'pager' => $this->pager
        ];