app/Models/CabangModel.php

    public function getCabang($id = false)
    {
        if (!$id) {
            return $this->findAll();
---
SELECT *
FROM `cabang`