app/Models/JenisBarangModel.php

SELECT *
FROM `jenis_barang`
---
    public function getJenisBarang($id = false)
    {
        if (!$id) {
            return $this->findAll();